Attribute VB_Name = "modRibbon"
Option Explicit

'************************************************************************************
' 機　能    :リボンインスタンスとグローバル変数の管理モジュール
' -----------------------------------------------------------------------------------
' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
'************************************************************************************

'リボンインスタンス
Public m_ribbon As IRibbonUI

'********************************************************************************
' SaveTestData
'********************************************************************************

''CaseNo.
'Public m_caseNoText As String
'
''SavePath
'Public m_savePathText As String
'
''TestPath
'Public m_testPathText As String
'
''********************************************************************************
'' Inspection（Pattern/HopeResult）
''********************************************************************************
'
''パターン列
'Public m_colPattern As String
'
'
''期待結果列
'Public m_colHopeResult As String
'
''********************************************************************************
'' Inspection（MvCase）
''********************************************************************************
'
''統合先CaseNo.
'Public m_moveForText As String
'
''移動対象CaseNo.
'Public m_moveToText As String
'
''統合後シート名
'Public m_afterNameText As String
'
''********************************************************************************
'' Editor
''********************************************************************************
'
''FllWith
'Public m_fillWithText As String
'
''ConnectArrow（Begin）チェックボックス
'Public m_chkLeft As Boolean
'
''ConnectArrow（End）チェックボックス
'Public m_chkRight As Boolean

'************************************************************************************
' 機　能    :リボンインスタンス取得
' -----------------------------------------------------------------------------------
' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
'************************************************************************************
Private Sub OnLoad(ribbon As IRibbonUI)
    
    'リボンインスタンス取得
    Set m_ribbon = ribbon

'    'チェックOFF_ConnectArrow（Begin）チェックボックス
'    m_chkLeft = False
'
'    'チェックOFF_ConnectArrow（End）チェックボックス
'    m_chkRight = False
'
'    '初期値設定_Fllwith
'    m_fillWithText = "－"
'
'    '初期値設定_パターン列
'    m_colPattern = "E"
'
'    '初期値設定_期待結果列
'    m_colHopeResult = "H"

End Sub

'************************************************************************************
' 機　能    :リボンインスタンス取得
' -----------------------------------------------------------------------------------
' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
'************************************************************************************
Sub loadImage(imageID As String, ByRef returnedVal)

    Dim shp As Shape
    Set shp = shImg.Shapes(imageID)

    Dim picPath As String
    picPath = ThisWorkbook.path & "\" & shp.Name & ".bmp"

    Call shapesSaveAsPicture(shp, picPath)

    Set returnedVal = LoadPicture(picPath)

    Call Kill(picPath)

End Sub


'************************************************************************************
' 機　能    :カスタムタブ取得
' -----------------------------------------------------------------------------------
' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
'************************************************************************************
Private Sub btnVbaExport_Click(ByRef control As IRibbonControl)
    Call frmVBExportShow
End Sub

'************************************************************************************
' 機　能    :カスタムタブ取得
' -----------------------------------------------------------------------------------
' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
'************************************************************************************
Private Sub customTab_getVisible(ByRef control As IRibbonControl, ByRef returnedVal)
    '常にタブを表示する
    returnedVal = True
End Sub

''************************************************************************************
'' 機　能    :テキストボックス読み込み
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub caseNoText_getText(ByRef control As IRibbonControl, ByRef Text)
'    Text = m_caseNoText
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス更新時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub caseNoText_onChange(ByRef control As IRibbonControl, ByRef Text As String)
'    m_caseNoText = Text
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス読み込み
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub savePathText_getText(ByRef control As IRibbonControl, ByRef Text)
'    Text = m_savePathText
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス更新時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub savePathText_onChange(ByRef control As IRibbonControl, ByRef Text As String)
'    m_savePathText = Text
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス読み込み
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub testPathText_getText(ByRef control As IRibbonControl, ByRef Text)
'    Text = m_testPathText
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス更新時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub testPathText_onChange(ByRef control As IRibbonControl, ByRef Text As String)
'    m_testPathText = Text
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス読み込み
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub afterNameText_getText(ByRef control As IRibbonControl, ByRef Text)
'    Text = m_afterNameText
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス更新時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub afterNameText_onChange(ByRef control As IRibbonControl, ByRef Text As String)
'    m_afterNameText = Text
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス読み込み
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub moveForText_getText(ByRef control As IRibbonControl, ByRef Text)
'    Text = m_moveForText
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス更新時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub moveForText_onChange(ByRef control As IRibbonControl, ByRef Text As String)
'    m_moveForText = Text
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス読み込み
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub moveToText_getText(ByRef control As IRibbonControl, ByRef Text)
'    Text = m_moveToText
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス更新時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub moveToText_onChange(ByRef control As IRibbonControl, ByRef Text As String)
'    m_moveToText = Text
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス読み込み
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub fillWithText_getText(ByRef control As IRibbonControl, ByRef Text)
'    Text = m_fillWithText
'End Sub
'
''************************************************************************************
'' 機　能    :テキストボックス更新時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Private Sub fillWithText_onChange(ByRef control As IRibbonControl, ByRef Text As String)
'    m_fillWithText = Text
'End Sub
'
'''************************************************************************************
''' 機　能    :テキストボックス読み込み
''' -----------------------------------------------------------------------------------
''' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
'''************************************************************************************
''Private Sub diffShNm_getText(ByRef control As IRibbonControl, ByRef Text)
''    Text = m_diffShNm
''End Sub
'
'''************************************************************************************
''' 機　能    :テキストボックス更新時処理
''' -----------------------------------------------------------------------------------
''' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
'''************************************************************************************
''Public Sub diffShNm_onChange(ByRef control As IRibbonControl, ByRef Text As String)
''    m_diffShNm = Text
''End Sub
'
''************************************************************************************
'' 機　能    :チェックボックス取得処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Sub getPressedLeft(control As IRibbonControl, ByRef returnedVal)
'    ' チェックボックスにチェックを設定する
'    returnedVal = m_chkLeft
'End Sub
'
''************************************************************************************
'' 機　能    :チェックボックス押下時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Sub chkLeft_onAction(control As IRibbonControl, pressed As Boolean)
'    ' チェックボックスのクリック処理
'    m_chkLeft = pressed
'End Sub
'
''************************************************************************************
'' 機　能    :チェックボックス取得処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Sub getPressedRight(control As IRibbonControl, ByRef returnedVal)
'    ' チェックボックスにチェックを設定する
'    returnedVal = m_chkRight
'End Sub
'
''************************************************************************************
'' 機　能    :チェックボックス押下時処理
'' -----------------------------------------------------------------------------------
'' 履　歴　　:2018/12/04  NII  Ver.1.0.00  新規作成
''************************************************************************************
'Sub chkRight_onAction(control As IRibbonControl, pressed As Boolean) ' チェックボックスのクリック処理
'  m_chkRight = pressed
'End Sub

